/* Error message string. The first %@ is the file name, the second the error message */
"Could not extract the file \"%@\": %@" = "Impossível extrair o ficheiro \"%1$@\": %2$@";

/* Error message for resource forks. The first %@ is the file name, the second the error message */
"Could not extract the resource fork for the file \"%@\":\n%@" = "Impossível extrair o resource fork para o ficheiro \"%1$@\":\n%2$@";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Detectar automaticamente";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Extrair";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Extrair Arquivo";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Extraindo \"%@\"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Preparando para extrair \"%@\"";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Seleccionar";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "Os conteúdos do ficheiro \"%@\" não podem ser extraídos com este programa.";

/* Error message string when writing is impossible. */
"Could not write to the destination directory." = "Não foi possível escrever no directório de destino.";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */

/* Common errors */
"Input data buffers border exceeded" = "O ficheiro de arquivo está incompleto";
"Opening file failed" = "O ficheiro não pode ser aberto";
"Missing or wrong password" = "A palavra passe fornecida está incorrecta";
"Wrong checksum" = "O ficheiro de arquivo está corrompido";
"Could not create directory" = "A pasta não pode ser criada";

/* Uncommon or unused errors */
"Unknown error" = "Erro desconhecido";
"Output data buffers border exceeded" = "O limite do buffer de saída de dados excedeu";
"Function called with illegal parameters" = "Função chamada com parâmetros ilegais";
"Not enough memory available" = "Não há memória disponível suficiente";
"Data is corrupted" = "Os dados estão corrompidos";
"Command is not supported" = "O comando não é suportado";
"Required resource missing" = "Recurso necessário em falta";
"Error on decrunching" = "Erro ao descodificar";
"Unknown file type" = "Tipo de ficheiro desconhecido";
"File, disk has been skipped" = "Ficheiro, o disco foi ignorado";
"User break in progress hook" = "O utilizador cancelou enquanto se processava a tarefa";
"File already exists" = "O ficheiro já existe";
"Verify failed (disk hook)" = "Verificação falhada (disco bloqueado)";
"Wrong drive geometry" = "Geometria da unidade incorrecta";
"Unknown data format" = "Formato de dados desconhecido";
"Source contains no files" = "A fonte não contém ficheiros";
"Unknown filesystem" = "Sistema de ficheiros desconhecido";
"Name of file exists as directory" = "O nome do ficheiro existe como directório";
"Buffer was too short" = "O buffer é demasiado pequeno";
"Text encoding was defective" = "A codificação do texto é defeituosa";
